src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОбщийМодульСервер_УправлениеФормами/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль сервер: управление формами.
// Программное создание и очистка элементов управляемых форм.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет или пересоздаёт декорацию-надпись на форме.
// ПодсказкаНавигации — строка для обработчика нажатия (например, "Расходы|Сегодня" или "Счет|<УИД>").
//
Процедура ДобавитьДекорациюНаФорму(Форма, ИмяДекорации, ЗаголовокДекорации, ИмяРодитель,
	ИзменитьЦветШрифта = Ложь, ГоризонтальноеПоложениеЛево = Истина, ПодсказкаНавигации = "") Экспорт
	
	ДекорацияУжеСоздана = ПроверитьСуществованиеЭлементаФормы(Форма, ИмяДекорации);
	
	Если Не ДекорацияУжеСоздана Тогда
		
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
		
	Иначе
		
		Форма.Элементы.Удалить(Форма.Элементы[ИмяДекорации]);
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
		
	КонецЕсли;
	
	мДекорация.Вид = ВидДекорацииФормы.Надпись;
	мДекорация.Заголовок = ЗаголовокДекорации;
	мДекорация.ГоризонтальноеПоложениеВГруппе = ?(ГоризонтальноеПоложениеЛево,
		ГоризонтальноеПоложениеЭлемента.Лево, ГоризонтальноеПоложениеЭлемента.Право);
	мДекорация.РастягиватьПоГоризонтали = Истина;
	мДекорация.Гиперссылка = Истина;
	мДекорация.УстановитьДействие("Нажатие", "ОбработкаНавигационнойСсылки");
	
	Если ЗначениеЗаполнено(ПодсказкаНавигации) Тогда
		
		мДекорация.Подсказка = ПодсказкаНавигации;
		
	КонецЕсли;
	
	Если ИзменитьЦветШрифта Тогда
		
		мДекорация.ЦветТекста = Новый Цвет(0, 0, 255);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет или пересоздаёт декорацию-картинку вида счёта.
//
Процедура ДобавитьКартинкуСчетаДекорации(Форма, ИмяДекорации, ИмяРодитель, ВидСчета) Экспорт
	
	ДекорацияУжеСоздана = ПроверитьСуществованиеЭлементаФормы(Форма, ИмяДекорации);
	
	Если Не ДекорацияУжеСоздана Тогда
		
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
		
	Иначе
		
		Форма.Элементы.Удалить(Форма.Элементы[ИмяДекорации]);
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
		
	КонецЕсли;
	
	мДекорация.Вид = ВидДекорацииФормы.Картинка;
	мДекорация.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		мДекорация.Картинка = БиблиотекаКартинок.ОбщаяКартинка_Кошелек;
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		мДекорация.Картинка = БиблиотекаКартинок.ОбщаяКартинка_БанковскийСчет;
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскаяКарта Тогда
		
		мДекорация.Картинка = БиблиотекаКартинок.ОбщаяКартинка_БанковскаяКарта;
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет или пересоздаёт группу формы.
//
Процедура ДобавитьГруппуНаФорму(Форма, ИмяГруппы, ЗаголовокГруппы, ИмяРодитель = Неопределено) Экспорт
	
	ГруппаУжеСоздана = ПроверитьСуществованиеЭлементаФормы(Форма, ИмяГруппы);
	
	Если ГруппаУжеСоздана Тогда
		
		Форма.Элементы.Удалить(Форма.Элементы[ИмяГруппы]);
		
	КонецЕсли;
	
	мГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Форма.Элементы[ИмяРодитель]);
	мГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	мГруппа.ОтображатьЗаголовок = Ложь;
	мГруппа.РастягиватьПоГоризонтали = Истина;
	мГруппа.Заголовок = ЗаголовокГруппы;
	
КонецПроцедуры

// Добавляет на форму поля ввода по списку имён реквизитов формы.
//
Процедура ДобавитьРеквизитНаФорму(Форма, МассивРеквизитов, Родитель = Неопределено) Экспорт
	
	Для Каждого Реквизит Из МассивРеквизитов Цикл
		
		НовыйЭлемент = Форма.Элементы.Добавить(Реквизит, Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = Реквизит;
		
		#Если МобильноеПриложениеСервер Тогда
		НовыйЭлемент.РедактированиеТекста = Ложь;
		#КонецЕсли
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет все подчинённые элементы указанной группы формы.
//
Процедура ОчиститьПодчиненныеЭлементыГруппы(Форма, ИмяГруппы) Экспорт
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	
	Если ГруппаФормы = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Пока ГруппаФормы.ПодчиненныеЭлементы.Количество() > 0 Цикл
		
		Форма.Элементы.Удалить(ГруппаФормы.ПодчиненныеЭлементы[0]);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает строку без дефисов для использования в имени элемента формы.
//
Функция ИдентификаторДляИмениЭлемента(УникальныйИдентификаторЗначения) Экспорт
	
	Возврат СтрЗаменить(Строка(УникальныйИдентификаторЗначения), "-", "");
	
КонецФункции

// Назначает обработчик события элементу формы.
//
Процедура УстановитьДействиеРеквизитуНаФорме(Форма, ИмяРеквизита, ИмяДействия, ИмяПроцедурыДействия) Экспорт
	
	Форма.Элементы.Найти(ИмяРеквизита).УстановитьДействие(ИмяДействия, ИмяПроцедурыДействия);
	
КонецПроцедуры

// Добавляет кнопку формы, связанную с командой формы.
//
Процедура ДобавитьКомандуНаФорму(Форма, ИмяКоманды, ИмяКомандыНаФорме, ЗаголовокКоманды) Экспорт
	
	КомандаНаФорме = Форма.Элементы.Добавить(ИмяКомандыНаФорме, Тип("КнопкаФормы"));
	КомандаНаФорме.ИмяКоманды = ИмяКоманды;
	КомандаНаФорме.Заголовок = ЗаголовокКоманды;
	КомандаНаФорме.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	КомандаНаФорме.РастягиватьПоГоризонтали = Истина;
	КомандаНаФорме.Фигура = ФигураКнопки.Овал;
	КомандаНаФорме.ЦветФона = WebЦвета.Зеленый;
	КомандаНаФорме.ЦветТекста = WebЦвета.Белый;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьСуществованиеЭлементаФормы(Форма, ИмяЭлемента)
	
	Возврат Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено;
	
КонецФункции

#КонецОбласти
